; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v8)
             (pred_1 ?v13 ?v9)
             (pred_9 ?v10 ?v9)
             (pred_4 ?v4 ?v10 )
	     (pred_3 ?v10)
             (pred_11 ?v2)
             (pred_7 ?v13)
             (pred_6 ?v9)
             (pred_5 ?v10)
             (pred_12 ?v13)
             (pred_10 ?v10)
             (pred_2 ))



(:action op_3
:parameters (?v6 ?v7 ?v12 ?v3)
:precondition (and (pred_11 ?v6) (pred_11 ?v7) (pred_7 ?v12) (pred_6 ?v3)
          (pred_8 ?v6 ?v7) (pred_1 ?v12 ?v3)
                   (pred_9 ?v7 ?v3) (pred_3 ?v6) 
                   (pred_5 ?v7) (pred_12 ?v12))
:effect (and  (pred_10 ?v7) (not (pred_5 ?v7))))


(:action op_4
:parameters (?v6 ?v11)
:precondition (and (pred_11 ?v6) (pred_11 ?v11)
               (pred_3 ?v6) (pred_8 ?v6 ?v11) (pred_10 ?v11))
:effect (and (pred_3 ?v11) (not (pred_3 ?v6))))

(:action op_1
:parameters (?v6 ?v12)
:precondition (and (pred_11 ?v6) (pred_7 ?v12) 
                  (pred_3 ?v6) (pred_4 ?v12 ?v6) (pred_2 ))
:effect (and (pred_12 ?v12)
   (not (pred_4 ?v12 ?v6)) (not (pred_2 ))))


(:action op_5
:parameters (?v6 ?v5 ?v1)
:precondition (and (pred_11 ?v6) (pred_7 ?v5) (pred_7 ?v1)
                  (pred_3 ?v6) (pred_12 ?v1) (pred_4 ?v5 ?v6))
:effect (and (pred_12 ?v5) (pred_4 ?v1 ?v6)
        (not (pred_12 ?v1)) (not (pred_4 ?v5 ?v6))))

(:action op_2
:parameters (?v6 ?v12)
:precondition (and (pred_11 ?v6) (pred_7 ?v12) 
                  (pred_3 ?v6) (pred_12 ?v12))
:effect (and (pred_2 ) (pred_4 ?v12 ?v6) (not (pred_12 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_08 obj_19 obj_15 obj_02 obj_04 obj_09 obj_01 obj_11 obj_03 obj_21 obj_17 obj_10 obj_12 obj_14 obj_06
    obj_05 obj_16
    obj_20 obj_18 obj_07
    )

    (:init
       (pred_2)

       (pred_11 obj_13)
       (pred_11 obj_08)
       (pred_11 obj_19)
       (pred_11 obj_15)
       (pred_11 obj_02)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_11 obj_11)
       (pred_11 obj_03)
       (pred_11 obj_21)
       (pred_11 obj_17)
       (pred_11 obj_10)
       (pred_11 obj_12)
       (pred_11 obj_14)
       (pred_11 obj_06)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_7 obj_20)
       (pred_7 obj_18)
       (pred_7 obj_07)

       (pred_8 obj_13 obj_02)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_08 obj_04)
       (pred_8 obj_08 obj_19)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_19 obj_09)
       (pred_8 obj_19 obj_15)
       (pred_8 obj_19 obj_08)
       (pred_8 obj_15 obj_01)
       (pred_8 obj_15 obj_19)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_08)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_09 obj_21)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_09 obj_19)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_01 obj_15)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_11 obj_10)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_21 obj_14)
       (pred_8 obj_21 obj_17)
       (pred_8 obj_21 obj_09)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_17 obj_21)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_11)
       (pred_8 obj_12 obj_14)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_14 obj_21)
       (pred_8 obj_14 obj_12)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_14)
       (pred_5 obj_21)
       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_9  obj_21 obj_05)
       (pred_9  obj_15 obj_16)
       (pred_9  obj_19 obj_05)
       (pred_10 obj_13)
       (pred_10 obj_08)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_01)
       (pred_10 obj_11)
       (pred_10 obj_03)
       (pred_10 obj_17)
       (pred_10 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_14)
       (pred_10 obj_06)

       (pred_1  obj_20 obj_05)
       (pred_1  obj_18 obj_16)
       (pred_1  obj_07 obj_16)
       (pred_4 obj_20 obj_03)
       (pred_4 obj_18 obj_11)
       (pred_4 obj_07 obj_04)
       (pred_3 obj_01)
    )

    (:goal (and
       (pred_4 obj_20 obj_02)
    ))
(:constraints
  (always (not (pred_3 obj_09)))
)
)

; plan
1. (op_4 obj_01 obj_17)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_17)
   goals met: 0 of 1
2. (op_4 obj_17 obj_06)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_06)
   goals met: 0 of 1
3. (op_4 obj_06 obj_14)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_14)
   goals met: 0 of 1
4. (op_4 obj_14 obj_12)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_12)
   goals met: 0 of 1
5. (op_4 obj_12 obj_03)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_03)
   goals met: 0 of 1
6. (op_1 obj_03 obj_20)
   deleted: (pred_4 obj_20 obj_03) (pred_2)
   added: (pred_12 obj_20)
   goals met: 0 of 1
7. (op_4 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 0 of 1
8. (op_4 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_02)
   goals met: 0 of 1
9. (op_2 obj_02 obj_20)
   deleted: (pred_12 obj_20)
   added: (pred_2) (pred_4 obj_20 obj_02)
   goals met: 1 of 1
